tools/perf/iteration17-final-websocket.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /work/k6/websocket-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 1000 looping VUs for 1m0s (gracefulStop: 30s)


running (0m00.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 1000 VUs  0m00.8s/1m0s

running (0m01.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 1000 VUs  0m01.8s/1m0s

running (0m02.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 1000 VUs  0m02.8s/1m0s

running (0m03.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 1000 VUs  0m03.8s/1m0s

running (0m04.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   8% ] 1000 VUs  0m04.8s/1m0s

running (0m05.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 1000 VUs  0m05.8s/1m0s

running (0m06.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  11% ] 1000 VUs  0m06.8s/1m0s

running (0m07.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 1000 VUs  0m07.8s/1m0s

running (0m08.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  15% ] 1000 VUs  0m08.8s/1m0s

running (0m09.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  16% ] 1000 VUs  0m09.8s/1m0s

running (0m10.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  18% ] 1000 VUs  0m10.8s/1m0s

running (0m11.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 1000 VUs  0m11.8s/1m0s

running (0m12.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  21% ] 1000 VUs  0m12.8s/1m0s

running (0m13.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  23% ] 1000 VUs  0m13.8s/1m0s

running (0m14.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  25% ] 1000 VUs  0m14.8s/1m0s

running (0m15.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  26% ] 1000 VUs  0m15.8s/1m0s

running (0m16.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  28% ] 1000 VUs  0m16.8s/1m0s

running (0m17.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 1000 VUs  0m17.8s/1m0s

running (0m18.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  31% ] 1000 VUs  0m18.8s/1m0s

running (0m19.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  33% ] 1000 VUs  0m19.8s/1m0s

running (0m20.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  35% ] 1000 VUs  0m20.8s/1m0s

running (0m21.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  36% ] 1000 VUs  0m21.8s/1m0s

running (0m22.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  38% ] 1000 VUs  0m22.8s/1m0s

running (0m23.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 1000 VUs  0m23.8s/1m0s

running (0m24.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  41% ] 1000 VUs  0m24.8s/1m0s

running (0m25.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  43% ] 1000 VUs  0m25.8s/1m0s

running (0m26.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  45% ] 1000 VUs  0m26.8s/1m0s

running (0m27.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  46% ] 1000 VUs  0m27.8s/1m0s

running (0m28.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  48% ] 1000 VUs  0m28.8s/1m0s

running (0m29.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  50% ] 1000 VUs  0m29.8s/1m0s

running (0m30.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  51% ] 1000 VUs  0m30.8s/1m0s

running (0m31.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  53% ] 1000 VUs  0m31.8s/1m0s

running (0m32.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  55% ] 1000 VUs  0m32.8s/1m0s

running (0m33.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  56% ] 1000 VUs  0m33.8s/1m0s

running (0m34.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  58% ] 1000 VUs  0m34.8s/1m0s

running (0m35.8s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  60% ] 1000 VUs  0m35.8s/1m0s

running (0m36.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  61% ] 1000 VUs  0m36.8s/1m0s

running (0m37.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  63% ] 1000 VUs  0m37.8s/1m0s

running (0m38.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  65% ] 1000 VUs  0m38.8s/1m0s

running (0m39.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  66% ] 1000 VUs  0m39.8s/1m0s

running (0m40.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  68% ] 1000 VUs  0m40.8s/1m0s

running (0m41.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  70% ] 1000 VUs  0m41.8s/1m0s

running (0m42.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  71% ] 1000 VUs  0m42.8s/1m0s

running (0m43.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  73% ] 1000 VUs  0m43.8s/1m0s

running (0m44.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  75% ] 1000 VUs  0m44.8s/1m0s

running (0m45.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  76% ] 1000 VUs  0m45.8s/1m0s

running (0m46.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  78% ] 1000 VUs  0m46.8s/1m0s

running (0m47.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  80% ] 1000 VUs  0m47.8s/1m0s

running (0m48.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  81% ] 1000 VUs  0m48.8s/1m0s

running (0m49.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  83% ] 1000 VUs  0m49.8s/1m0s

running (0m50.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  85% ] 1000 VUs  0m50.8s/1m0s

running (0m51.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  86% ] 1000 VUs  0m51.8s/1m0s

running (0m52.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  88% ] 1000 VUs  0m52.8s/1m0s

running (0m53.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  90% ] 1000 VUs  0m53.8s/1m0s

running (0m54.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  91% ] 1000 VUs  0m54.8s/1m0s

running (0m55.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [  93% ] 1000 VUs  0m55.8s/1m0s

running (0m56.9s), 1000/1000 VUs, 271 complete and 0 interrupted iterations
default   [  95% ] 1000 VUs  0m56.8s/1m0s

running (0m57.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default   [  96% ] 1000 VUs  0m57.8s/1m0s

running (0m58.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default   [  98% ] 1000 VUs  0m58.8s/1m0s

running (0m59.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default   [ 100% ] 1000 VUs  0m59.8s/1m0s

running (1m00.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m01.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m02.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m03.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m04.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m05.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m06.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m07.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m08.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m09.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m10.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m11.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m12.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m13.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m14.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m15.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m16.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m17.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m18.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m19.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m20.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m21.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m22.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m23.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m24.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m25.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m26.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m27.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m28.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s

running (1m29.9s), 1000/1000 VUs, 1000 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s


  █ THRESHOLDS 

    ws_connect_success_rate
    ✓ 'rate>0.95' rate=100.00%

    ws_connecting
    ✓ 'p(99)<1000' p(99)=586.07ms

    ws_latency_samples_total
    ✗ 'count>0' count=0

    ws_push_latency_ms
    ✓ 'p(99)<500' p(99)=0

    ws_stomp_connected_total
    ✓ 'count>0' count=2000


  █ TOTAL RESULTS 

    checks_total.......: 1       0.01109/s
    checks_succeeded...: 100.00% 1 out of 1
    checks_failed......: 0.00%   0 out of 1

    ✓ ws visible codes status is 200

    HTTP
    http_req_duration..............: avg=45.88ms min=45.88ms med=45.88ms max=45.88ms  p(90)=45.88ms  p(95)=45.88ms
      { expected_response:true }...: avg=45.88ms min=45.88ms med=45.88ms max=45.88ms  p(90)=45.88ms  p(95)=45.88ms
    http_req_failed................: 0.00%   0 out of 1
    http_reqs......................: 1       0.01109/s

    EXECUTION
    iteration_duration.............: avg=56.42s  min=56.09s  med=56.4s   max=56.78s   p(90)=56.66s   p(95)=56.73s 
    iterations.....................: 1000    11.090009/s
    vus............................: 1000    min=1000         max=1000
    vus_max........................: 1000    min=1000         max=1000

    NETWORK
    data_received..................: 851 kB  9.4 kB/s
    data_sent......................: 883 kB  9.8 kB/s

    WEBSOCKET
    ws_connect_success_rate........: 100.00% 1000 out of 1000
    ws_connecting..................: avg=163.4ms min=1.44ms  med=79.7ms  max=752.16ms p(90)=401.76ms p(95)=455.9ms
    ws_latency_samples_total.......: 0       0/s
    ws_msgs_received...............: 2000    22.180019/s
    ws_msgs_sent...................: 20396   226.191829/s
    ws_push_latency_ms.............: avg=0       min=0       med=0       max=0        p(90)=0        p(95)=0      
    ws_session_duration............: avg=55.42s  min=55.08s  med=55.4s   max=55.77s   p(90)=55.66s   p(95)=55.72s 
    ws_sessions....................: 2000    22.180019/s
    ws_stomp_connected_total.......: 2000    22.180019/s



running (1m30.2s), 0000/1000 VUs, 1000 complete and 1000 interrupted iterations
default ✓ [ 100% ] 1000 VUs  1m0s
time="2026-04-24T14:19:20Z" level=error msg="thresholds on metrics 'ws_latency_samples_total' have been crossed"